# The examples from the powerpoint

Just so you can run them, maybe alter and tinker a little with them. These are the first examples using apples and oranges.

First we install pandas. Issuing commands in a code block with an exclamation mark in front will run them in the current virtual environment.

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\jochen\onedrive - thomas more\_vakken\data science\datascience2022\venv\lib\site-packages (1.4.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jochen\onedrive - thomas more\_vakken\data science\datascience2022\venv\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jochen\onedrive - thomas more\_vakken\data science\datascience2022\venv\lib\site-packages (from pandas) (2022.2.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\jochen\onedrive - thomas more\_vakken\data science\datascience2022\venv\lib\site-packages (from pandas) (1.23.2)
Requirement already satisfied: six>=1.5 in c:\users\jochen\onedrive - thomas more\_vakken\data science\datascience2022\venv\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

WARNING: You are using pip version 21.2.4; however, version 22.2.2 is available.
You should consider upgrading via the 'C:\Users\Jochen\OneDrive - Thomas More\_Vakken\Data Science\Datascience2022\venv\Scripts\python.exe -m pip install --upgrade pip' command.

Next we can import it an start using pandas...

In [3]:
import pandas as pd
import numpy as np

Next we create a dataframe as a sum of two series.

In [4]:
data = np.array([3, 2, 0, 1])
apples = pd.Series(data)

data = np.array([0, 3, 7, 2])
oranges = pd.Series(data)


df = pd.DataFrame({'apples': apples, 'oranges': oranges})

print(apples, oranges, df, sep="\n")

0    3
1    2
2    0
3    1
dtype: int32
0    0
1    3
2    7
3    2
dtype: int32
   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

Or create the same dataframe by converting a dictionary.

In [5]:
data = { 
'apples': [3, 2, 0, 1], 
'oranges': [0, 3, 7, 2] 
}

purchases = pd.DataFrame(data)

purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [6]:
purchases = pd.DataFrame(data, index=['June', 'Robert', 'Lily', 'David']) 
purchases

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [7]:
lily_purchases = purchases.loc[ 'Lily' ] 
lily_purchases

apples     0
oranges    7
Name: Lily, dtype: int64

In [8]:
index_2_purchases = purchases.iloc[2] 
index_2_purchases

apples     0
oranges    7
Name: Lily, dtype: int64

In [9]:
index_2_3_purch = purchases.iloc[[2,3]] 
index_2_3_purch

       apples  oranges
Lily        0        7
David       1        2

In [10]:
index_0_2_3_purch = purchases.iloc[[0,2,3]] 
index_0_2_3_purch

       apples  oranges
June        3        0
Lily        0        7
David       1        2

In [11]:
purchases[0:4]

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [12]:
purchases[-1::-1]

        apples  oranges
David        1        2
Lily         0        7
Robert       2        3
June         3        0

In [13]:
purchases[1:2]

        apples  oranges
Robert       2        3

In [14]:
purchases[::+2]

      apples  oranges
June       3        0
Lily       0        7

In [15]:
purchases[-1:]

       apples  oranges
David       1        2

In [16]:
purchases['June':'David']

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [17]:
purchases['Robert':'Lily']

        apples  oranges
Robert       2        3
Lily         0        7

In [18]:
apples = purchases['apples']
# apples = purchases.apples
apples

June      3
Robert    2
Lily      0
David     1
Name: apples, dtype: int64

In [19]:
type(apples)

pandas.core.series.Series

In [20]:
oranges = purchases[['oranges']]
oranges

        oranges
June          0
Robert        3
Lily          7
David         2

In [21]:
type(oranges)

pandas.core.frame.DataFrame

In [22]:
purchases['bananas']=3
purchases

        apples  oranges  bananas
June         3        0        3
Robert       2        3        3
Lily         0        7        3
David        1        2        3

In [23]:
purchases['bananas']=[2,0,5,7]
purchases

        apples  oranges  bananas
June         3        0        2
Robert       2        3        0
Lily         0        7        5
David        1        2        7

In [24]:
purchases['lemons'] = range(1,len(purchases)+1,+1)
purchases

        apples  oranges  bananas  lemons
June         3        0        2       1
Robert       2        3        0       2
Lily         0        7        5       3
David        1        2        7       4

In [25]:
df = pd.read_csv('purchases.csv')
df

FileNotFoundError: [Errno 2] No such file or directory: 'purchases.csv'

In [ ]:
df = pd.read_csv('purchases.csv', index_col=0)
df

            apples   oranges
customers
June             3         0
Robert           2         3
Lily             0         7
David            1         2

In [ ]:
df = pd.read_json('purchases.json')
df

        apples  oranges
June         3        0
Robert       2        3
Lily         0        7
David        1        2

In [26]:
import sqlite3

con = sqlite3.connect("files/purchases.db")
df = pd.read_sql_query("SELECT c.name, p.quantity, p.fruit FROM customers c join purchases p on c.customerID = p.customerID", con)
df

     name  quantity    fruit
0    June         3   apples
1  Robert         2   apples
2    Lily         0   apples
3   David         1   apples
4    June         0  oranges
5  Robert         3  oranges
6    Lily         7  oranges
7   David         2  oranges

In [30]:
df = pd.read_json('files/purchases.json')

df.to_csv('new_purchases.csv') 
df.to_json('new_purchases.json')
# df.to_excel('new_purchases.xlsx')  -> requires openpyxl. Works, but needs to be installed using !pip install openpyxl
df.to_html('new_purchases.html')
con.execute("DROP TABLE IF EXISTS new_purchases;")
df.to_sql('new_purchases', con)

4